# CurveByPointsArray Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveByPointsArray Constructor
CurveByPointsArray Class See Also
---
Initializes a new instance of the CurveByPointsArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveByPointsArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
CurveByPointsArray()
```

# See Also
CurveByPointsArray Class
Autodesk.Revit.DB Namespace